In [3]:
import pandas as pd
import numpy as np

In [2]:
pd.DataFrame({'A': [1,2,3]})

   A
0  1
1  2
2  3

In [5]:
s=pd.Series([1,2,3,5, np.nan, 6,8])
s

0    1.0
1    2.0
2    3.0
3    5.0
4    NaN
5    6.0
6    8.0
dtype: float64

In [7]:
print(s)

0    1.0
1    2.0
2    3.0
3    5.0
4    NaN
5    6.0
6    8.0
dtype: float64

In [9]:
dates = pd.date_range("20241101", periods=6) #yyyymmdd
dates

DatetimeIndex(['2024-11-01', '2024-11-02', '2024-11-03', '2024-11-04',
               '2024-11-05', '2024-11-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df=pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2024-11-01 -0.668393 -0.576897  0.671319 -0.725978
2024-11-02  0.257016  0.214027 -0.488754  0.893367
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989
2024-11-04 -1.037308  1.030581  0.250836  0.810744
2024-11-05 -0.370698 -0.104254 -0.812296  0.866765
2024-11-06 -1.104879  1.392624  1.214158  1.865242

In [21]:
dff2=pd.DataFrame(np.random.randint(15,size=(6,4)), index=dates, columns=list("ABCD"))
dff2

             A   B   C   D
2024-11-01   2   6   6  12
2024-11-02   9   5   5   2
2024-11-03   3  12  13   7
2024-11-04   2   3  11  13
2024-11-05   9   6   2   8
2024-11-06  10  11   7   5

In [27]:
df2=pd.DataFrame(
    {
    "A": 1.0,
    "B": pd.Timestamp("20040104"),
    #"C": pd.Series(1,index=list(range(4))),
    "C": pd.Series(1,index=list(range(4)),dtype="float32"),
    #"D": np.array([3]*4,dtype="int32"),
    "D": np.array([3,4,5,6]),
    "E": pd.Categorical(["test","trains","validate","try"]),
    "F": "foo",}
)
df2

     A          B    C  D         E    F
0  1.0 2004-01-04  1.0  3      test  foo
1  1.0 2004-01-04  1.0  4    trains  foo
2  1.0 2004-01-04  1.0  5  validate  foo
3  1.0 2004-01-04  1.0  6       try  foo

In [29]:
type(df2)

pandas.core.frame.DataFrame

In [30]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [33]:
df.head(3)

                   A         B         C         D
2024-11-01 -0.668393 -0.576897  0.671319 -0.725978
2024-11-02  0.257016  0.214027 -0.488754  0.893367
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989

In [34]:
df.tail(2)

                   A         B         C         D
2024-11-05 -0.370698 -0.104254 -0.812296  0.866765
2024-11-06 -1.104879  1.392624  1.214158  1.865242

In [38]:
df.index

DatetimeIndex(['2024-11-01', '2024-11-02', '2024-11-03', '2024-11-04',
               '2024-11-05', '2024-11-06'],
              dtype='datetime64[ns]', freq='D')

In [39]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [45]:
n=df.to_numpy()
n

array([[-0.66839294, -0.57689661,  0.67131926, -0.72597822],
       [ 0.2570162 ,  0.21402666, -0.4887539 ,  0.89336656],
       [-2.00580989, -0.75710451, -0.15060577,  0.68998855],
       [-1.03730844,  1.03058054,  0.25083619,  0.81074431],
       [-0.3706981 , -0.10425363, -0.81229593,  0.8667653 ],
       [-1.10487925,  1.39262374,  1.21415807,  1.86524161]])

In [46]:
type(n)

numpy.ndarray

In [47]:
m=df2.to_numpy()
m

array([[1.0, Timestamp('2004-01-04 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2004-01-04 00:00:00'), 1.0, 4, 'trains', 'foo'],
       [1.0, Timestamp('2004-01-04 00:00:00'), 1.0, 5, 'validate', 'foo'],
       [1.0, Timestamp('2004-01-04 00:00:00'), 1.0, 6, 'try', 'foo']],
      dtype=object)

In [48]:
type(m)

numpy.ndarray

In [49]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.821679  0.199829  0.114110  0.733355
std    0.764111  0.863087  0.752467  0.832117
min   -2.005810 -0.757105 -0.812296 -0.725978
25%   -1.087987 -0.458736 -0.404217  0.720177
50%   -0.852851  0.054887  0.050115  0.838755
75%   -0.445122  0.826442  0.566198  0.886716
max    0.257016  1.392624  1.214158  1.865242

In [50]:
df2.describe()

         A                    B    C         D
count  4.0                    4  4.0  4.000000
mean   1.0  2004-01-04 00:00:00  1.0  4.500000
min    1.0  2004-01-04 00:00:00  1.0  3.000000
25%    1.0  2004-01-04 00:00:00  1.0  3.750000
50%    1.0  2004-01-04 00:00:00  1.0  4.500000
75%    1.0  2004-01-04 00:00:00  1.0  5.250000
max    1.0  2004-01-04 00:00:00  1.0  6.000000
std    0.0                  NaN  0.0  1.290994

In [51]:
df.T

   2024-11-01  2024-11-02  2024-11-03  2024-11-04  2024-11-05  2024-11-06
A   -0.668393    0.257016   -2.005810   -1.037308   -0.370698   -1.104879
B   -0.576897    0.214027   -0.757105    1.030581   -0.104254    1.392624
C    0.671319   -0.488754   -0.150606    0.250836   -0.812296    1.214158
D   -0.725978    0.893367    0.689989    0.810744    0.866765    1.865242

In [54]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2024-11-01 -0.725978  0.671319 -0.576897 -0.668393
2024-11-02  0.893367 -0.488754  0.214027  0.257016
2024-11-03  0.689989 -0.150606 -0.757105 -2.005810
2024-11-04  0.810744  0.250836  1.030581 -1.037308
2024-11-05  0.866765 -0.812296 -0.104254 -0.370698
2024-11-06  1.865242  1.214158  1.392624 -1.104879

In [55]:
df.sort_index(axis=0,ascending=False)

                   A         B         C         D
2024-11-06 -1.104879  1.392624  1.214158  1.865242
2024-11-05 -0.370698 -0.104254 -0.812296  0.866765
2024-11-04 -1.037308  1.030581  0.250836  0.810744
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989
2024-11-02  0.257016  0.214027 -0.488754  0.893367
2024-11-01 -0.668393 -0.576897  0.671319 -0.725978

In [56]:
df["A"]

2024-11-01   -0.668393
2024-11-02    0.257016
2024-11-03   -2.005810
2024-11-04   -1.037308
2024-11-05   -0.370698
2024-11-06   -1.104879
Freq: D, Name: A, dtype: float64

In [71]:
df[0:3]

                   A         B         C         D
2024-11-01 -0.668393 -0.576897  0.671319 -0.725978
2024-11-02  0.257016  0.214027 -0.488754  0.893367
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989

In [72]:
df["20241102":"20241104"] #slice till

                   A         B         C         D
2024-11-02  0.257016  0.214027 -0.488754  0.893367
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989
2024-11-04 -1.037308  1.030581  0.250836  0.810744

### Loc
loc is applied to dataframes only

In [73]:
df.loc[dates[0]] #for row matching/selecting

A   -0.668393
B   -0.576897
C    0.671319
D   -0.725978
Name: 2024-11-01 00:00:00, dtype: float64

In [74]:
df.loc[:,["A","B"]]

                   A         B
2024-11-01 -0.668393 -0.576897
2024-11-02  0.257016  0.214027
2024-11-03 -2.005810 -0.757105
2024-11-04 -1.037308  1.030581
2024-11-05 -0.370698 -0.104254
2024-11-06 -1.104879  1.392624

In [75]:
df.loc[dates[0],["A","D"]]

A   -0.668393
D   -0.725978
Name: 2024-11-01 00:00:00, dtype: float64

In [76]:
df.loc["20241102":"20241104",["A","C"]]

                   A         C
2024-11-02  0.257016 -0.488754
2024-11-03 -2.005810 -0.150606
2024-11-04 -1.037308  0.250836

In [84]:
#df.loc["20241102":"20241104",0:2] #error

### Fast Access Scalar: at (will always give single value, faster than loc)

In [77]:
df.at[dates[0],"A"]

-0.6683929378512177

In [79]:
#df.at[:,["A","B"]] #error

In [80]:
df.iloc[3]

A   -1.037308
B    1.030581
C    0.250836
D    0.810744
Name: 2024-11-04 00:00:00, dtype: float64

In [81]:
df

                   A         B         C         D
2024-11-01 -0.668393 -0.576897  0.671319 -0.725978
2024-11-02  0.257016  0.214027 -0.488754  0.893367
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989
2024-11-04 -1.037308  1.030581  0.250836  0.810744
2024-11-05 -0.370698 -0.104254 -0.812296  0.866765
2024-11-06 -1.104879  1.392624  1.214158  1.865242

In [86]:
df.iloc[3:,0:2] #in loc we cannot slice column by index, we have to give column name

                   A         B
2024-11-04 -1.037308  1.030581
2024-11-05 -0.370698 -0.104254
2024-11-06 -1.104879  1.392624

In [87]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2024-11-02  0.257016 -0.488754
2024-11-03 -2.005810 -0.150606
2024-11-05 -0.370698 -0.812296

In [88]:
df.iloc[1,1]

0.2140266550806666

In [89]:
df.iat[1,1]

0.2140266550806666

In [93]:
df[df["C"]>0]

                   A         B         C         D
2024-11-01 -0.668393 -0.576897  0.671319 -0.725978
2024-11-04 -1.037308  1.030581  0.250836  0.810744
2024-11-06 -1.104879  1.392624  1.214158  1.865242

In [94]:
df[df>0]

                   A         B         C         D
2024-11-01       NaN       NaN  0.671319       NaN
2024-11-02  0.257016  0.214027       NaN  0.893367
2024-11-03       NaN       NaN       NaN  0.689989
2024-11-04       NaN  1.030581  0.250836  0.810744
2024-11-05       NaN       NaN       NaN  0.866765
2024-11-06       NaN  1.392624  1.214158  1.865242

### isin method for filtering

In [95]:
df3=df.copy()
df3

                   A         B         C         D
2024-11-01 -0.668393 -0.576897  0.671319 -0.725978
2024-11-02  0.257016  0.214027 -0.488754  0.893367
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989
2024-11-04 -1.037308  1.030581  0.250836  0.810744
2024-11-05 -0.370698 -0.104254 -0.812296  0.866765
2024-11-06 -1.104879  1.392624  1.214158  1.865242

In [99]:
df3["E"]=["one","one","two","three","four",np.nan]
df3

                   A         B         C         D      E
2024-11-01 -0.668393 -0.576897  0.671319 -0.725978    one
2024-11-02  0.257016  0.214027 -0.488754  0.893367    one
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989    two
2024-11-04 -1.037308  1.030581  0.250836  0.810744  three
2024-11-05 -0.370698 -0.104254 -0.812296  0.866765   four
2024-11-06 -1.104879  1.392624  1.214158  1.865242    NaN

In [101]:
df3[df3["E"].isin(["five","four"])]

                   A         B         C         D     E
2024-11-05 -0.370698 -0.104254 -0.812296  0.866765  four

In [105]:
df.iat[0,1]=2 #to change any specific value
df

                   A         B         C         D
2024-11-01 -0.668393  2.000000  0.671319 -0.725978
2024-11-02  0.257016  0.214027 -0.488754  0.893367
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989
2024-11-04 -1.037308  1.030581  0.250836  0.810744
2024-11-05 -0.370698 -0.104254 -0.812296  0.866765
2024-11-06 -1.104879  1.392624  1.214158  1.865242

In [107]:
df.loc[:,"D"]=np.array([5]*len(df))
df

                   A         B         C    D
2024-11-01 -0.668393  2.000000  0.671319  5.0
2024-11-02  0.257016  0.214027 -0.488754  5.0
2024-11-03 -2.005810 -0.757105 -0.150606  5.0
2024-11-04 -1.037308  1.030581  0.250836  5.0
2024-11-05 -0.370698 -0.104254 -0.812296  5.0
2024-11-06 -1.104879  1.392624  1.214158  5.0

In [110]:
df.iloc[:,3]=np.array([4]*len(df))
df

                   A         B         C    D
2024-11-01 -0.668393  2.000000  0.671319  4.0
2024-11-02  0.257016  0.214027 -0.488754  4.0
2024-11-03 -2.005810 -0.757105 -0.150606  4.0
2024-11-04 -1.037308  1.030581  0.250836  4.0
2024-11-05 -0.370698 -0.104254 -0.812296  4.0
2024-11-06 -1.104879  1.392624  1.214158  4.0

In [111]:
df2

     A          B    C  D         E    F
0  1.0 2004-01-04  1.0  3      test  foo
1  1.0 2004-01-04  1.0  4    trains  foo
2  1.0 2004-01-04  1.0  5  validate  foo
3  1.0 2004-01-04  1.0  6       try  foo

In [116]:
df[df<0]=-df
df

                   A         B         C    D
2024-11-01  0.668393  2.000000  0.671319  4.0
2024-11-02       NaN       NaN       NaN  4.0
2024-11-03  2.005810  0.757105       NaN  4.0
2024-11-04  1.037308  1.030581       NaN  4.0
2024-11-05       NaN       NaN  0.812296  4.0
2024-11-06  1.104879  1.392624  1.214158  4.0

In [117]:
df[df<0.5]=np.nan
df

                   A         B         C    D
2024-11-01  0.668393  2.000000  0.671319  4.0
2024-11-02       NaN       NaN       NaN  4.0
2024-11-03  2.005810  0.757105       NaN  4.0
2024-11-04  1.037308  1.030581       NaN  4.0
2024-11-05       NaN       NaN  0.812296  4.0
2024-11-06  1.104879  1.392624  1.214158  4.0

In [118]:
df.dropna(how="any")

                   A         B         C    D
2024-11-01  0.668393  2.000000  0.671319  4.0
2024-11-06  1.104879  1.392624  1.214158  4.0